## Introduction

This notebook will show you how to import data from a SQL query into a DataFrame.

Before you proceed, you MUST do the following:

* use `mysqlsh` to create the `rainchannel_measurements` table and insert data using the script `rainchannel_measurements.sql`
* edit the connection string below using your username, password, and chosen database

In [6]:
import pandas as pd
import mysql.connector

# fill in any relevant details that need to be changed here, such as if you set up a different user or password
myconnection = mysql.connector.connect(user='root', password='Leftw!ng6977',
                                 host='127.0.0.1',
                                 database='Test')

The pandas method [`read_sql_query`](https://pandas.pydata.org/pandas-docs/version/0.22/generated/pandas.read_sql_query.html) can be used to read data from a SQL table. You need a SQL query and a compatible connection or connection string. A number of options are available to wrangle data into a suitable format.

In [4]:
# the SQL query we're going to use. 
# Remember to filter as much as you can in your query to improve the performance of your analysis.

queryString = "SELECT * FROM rainchannel_measurements;"

rain_df = pd.read_sql_query(queryString, myconnection)

             channel  measurement_year    rainfall_mm  rg_active
count  384954.000000     384954.000000  384954.000000   384954.0
mean       21.308362       2014.404737       0.318660        1.0
std        12.390120          2.778632       0.446649        0.0
min         1.000000       2010.000000       0.100000        1.0
25%        11.000000       2012.000000       0.200000        1.0
50%        21.000000       2014.000000       0.200000        1.0
75%        32.000000       2016.000000       0.200000        1.0
max        48.000000       2019.000000      43.200000        1.0

In [5]:
rain_df.describe()
rain_df.head()

,channel,measurement_year,measurement_ts,rainfall_mm,rg_active,id
0,3,2010,2010-05-01 22:15:00,0.2,1,2010-05-01T22:15:00-03
1,3,2010,2010-05-01 22:20:00,0.2,1,2010-05-01T22:20:00-03
2,5,2010,2010-05-01 22:25:00,0.2,1,2010-05-01T22:25:00-05
3,18,2010,2010-05-01 23:40:00,0.2,1,2010-05-01T23:40:00-18
4,5,2010,2010-05-02 03:30:00,0.2,1,2010-05-02T03:30:00-05

Now that we have this, we can begin to analyze this table as we did before.

Write some code to:
- find the timestamp and channel where the highest rainfall values were recorded
- find the channel which returned the highest rainfall value in June 2013
- find the month where channel 9 recorded the most rainfall
- find the average rainfall per channel in August 2017